
### Terraform Status default

#### Terraform Format and Style 🖌 `success`
#### Terraform Validate 📖 `success`
#### Terraform Plan 📖 `success`
<details>
<summary>Show Plan</summary>

```
module.metabase.module.db_default.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=rmxHsQ]
module.metabase.data.aws_ssm_parameter.ecs_optimized_ami: Reading...
module.metabase.data.aws_availability_zones.available: Reading...
module.metabase.module.db_default.module.db_instance.data.aws_partition.current: Reading...
module.metabase.module.ecs_service.data.aws_partition.current: Reading...
module.metabase.module.alb.data.aws_partition.current: Reading...
module.metabase.module.db_default.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.metabase.module.ecs_cluster.module.cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/cluster01]
module.metabase.module.ecs_service.data.aws_region.current: Reading...
module.metabase.module.ecs_service.module.container_definition["ecs-sample"].aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/cluster01/ecs-sample]
module.metabase.module.ecs_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.metabase.module.db_default.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.metabase.module.ecs_service.data.aws_region.current: Read complete after 0s [id=sa-east-1]
module.metabase.module.db_default.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.metabase.module.alb.data.aws_partition.current: Read complete after 0s [id=aws]
module.metabase.module.ecs_service.data.aws_caller_identity.current: Reading...
module.metabase.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-018ddafc6bd1aca97]
module.metabase.module.autoscaling["pool1"].data.aws_default_tags.current: Reading...
module.metabase.module.autoscaling["pool1"].data.aws_partition.current: Reading...
module.metabase.module.ecs_service.module.container_definition["metabase"].data.aws_region.current: Reading...
module.metabase.module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Reading...
module.metabase.module.ecs_service.module.container_definition["metabase"].data.aws_region.current: Read complete after 0s [id=sa-east-1]
module.metabase.module.autoscaling["pool1"].data.aws_default_tags.current: Read complete after 0s [id=aws]
module.metabase.module.autoscaling["pool1"].data.aws_partition.current: Read complete after 0s [id=aws]
module.metabase.module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Read complete after 0s [id=2291109037]
module.metabase.module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Reading...
module.metabase.module.autoscaling["pool1"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.metabase.module.ecs_service.aws_iam_role.task_exec[0]: Refreshing state... [id=cluster01-20240408193645779800000003]
module.metabase.module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Read complete after 0s [id=1415633931]
module.metabase.module.autoscaling["pool1"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=1256122602]
module.metabase.module.ecs_service.aws_iam_policy.task_exec[0]: Refreshing state... [id=arn:aws:iam::905418314539:policy/cluster01-20240408193645779600000002]
module.metabase.module.autoscaling["pool1"].aws_iam_role.this[0]: Refreshing state... [id=cluster01-20240408193645780300000004]
module.metabase.module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=905418314539]
module.metabase.module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Reading...
module.metabase.module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Read complete after 0s [id=3737312162]
module.metabase.module.ecs_service.aws_iam_role.tasks[0]: Refreshing state... [id=cluster01-20240408193645779500000001]
module.metabase.module.autoscaling["pool1"].aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=cluster01-20240408193645780300000004-20240408193646046900000007]
module.metabase.module.autoscaling["pool1"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerServiceforEC2Role"]: Refreshing state... [id=cluster01-20240408193645780300000004-20240408193646056800000008]
module.metabase.module.autoscaling["pool1"].aws_iam_instance_profile.this[0]: Refreshing state... [id=cluster01-20240408193645977600000005]
module.metabase.module.ecs_service.aws_iam_role_policy_attachment.task_exec[0]: Refreshing state... [id=cluster01-20240408193645779800000003-20240408193646029700000006]
module.metabase.data.aws_ssm_parameter.ecs_optimized_ami: Read complete after 1s [id=/aws/service/ecs/optimized-ami/amazon-linux-2/recommended]
module.metabase.data.aws_availability_zones.available: Read complete after 1s [id=sa-east-1]
module.metabase.module.ecs_cluster.module.cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:sa-east-1:905418314539:cluster/cluster01]
module.metabase.module.ecs_service.aws_ecs_task_definition.this[0]: Refreshing state... [id=cluster01]
module.metabase.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-039e28ea43855af32]
module.metabase.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0e6242e4d8785dc4d]
module.metabase.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-04fa9c63e9807ccc3]
module.metabase.module.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-013d1c9364956696d]
module.metabase.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0c4723b7070ded35e]
module.metabase.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-00e15cf661b6b1690]
module.metabase.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-06fb21169727d805d]
module.metabase.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-096726c58ecc18380]
module.metabase.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02fc0d497d4b4c1a2]
module.metabase.module.alb.aws_lb_target_group.this["metabase_ecs"]: Refreshing state... [id=arn:aws:elasticloadbalancing:sa-east-1:905418314539:targetgroup/tf-2024040819370025460000000c/2decd681597abeb6]
module.metabase.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-012bd258177fae471]
module.metabase.module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-03ea8f18a31222fc5]
module.metabase.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00cc8486d41442bd2]
module.metabase.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09f61bb12645d03c9]
module.metabase.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-09dde8375d81e3c1c]
module.metabase.module.autoscaling_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-04ef1fe5f475a215b]
module.metabase.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-04fa9c63e9807ccc31080289494]
module.metabase.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0602ca4d9900d652d]
module.metabase.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0ea91a0c040002f4f]
module.metabase.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0538b6995262f2c57]
module.metabase.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-09d257a654b487b0c]
module.metabase.module.rds_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-3887699087]
module.metabase.module.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-07b78c53ce61c150c]
module.metabase.module.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-0012688482a5bb6f3]
module.metabase.module.ecs_service.data.aws_subnet.this[0]: Reading...
module.metabase.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0463047c70ec78501]
module.metabase.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-094838c63c8cb6ccc]
module.metabase.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-018c808356f075083]
module.metabase.module.autoscaling_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1933095308]
module.metabase.module.autoscaling_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-414921767]
module.metabase.module.autoscaling["pool1"].aws_launch_template.this[0]: Refreshing state... [id=lt-0045d92b2fc22fe4e]
module.metabase.module.rds_security_group.aws_security_group_rule.computed_ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-488687879]
module.metabase.module.ecs_service.data.aws_subnet.this[0]: Read complete after 0s [id=subnet-06fb21169727d805d]
module.metabase.module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:sa-east-1:905418314539:loadbalancer/app/cluster01/9f8a96a75736b1c8]
module.metabase.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0764f8c415eaca27d]
module.metabase.module.db_default.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-DCEUY5V77F7E23L6YTTKQWDSVU]
module.metabase.module.ecs_service.aws_security_group.this[0]: Refreshing state... [id=sg-062dcc6a2202100ce]
module.metabase.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-02fc0d497d4b4c1a21080289494]
module.metabase.module.ecs_service.aws_security_group_rule.this["alb_http_ingress"]: Refreshing state... [id=sgrule-2840602637]
module.metabase.module.autoscaling["pool1"].aws_autoscaling_group.idc[0]: Refreshing state... [id=cluster01-pool1-20240408194420311400000001]
module.metabase.module.alb.aws_lb_listener.this["ex_http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:sa-east-1:905418314539:listener/app/cluster01/9f8a96a75736b1c8/5e502b3dddf54bca]
module.metabase.module.ecs_cluster.module.cluster.aws_ecs_capacity_provider.this["pool1"]: Refreshing state... [id=arn:aws:ecs:sa-east-1:905418314539:capacity-provider/pool1]
module.metabase.module.ecs_cluster.module.cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=cluster01]
module.metabase.module.ecs_service.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:sa-east-1:905418314539:service/cluster01/cluster01]
module.metabase.module.ecs_service.aws_appautoscaling_target.this[0]: Refreshing state... [id=service/cluster01/cluster01]
module.metabase.module.ecs_service.aws_appautoscaling_policy.this["cpu"]: Refreshing state... [id=cpu]
module.metabase.module.ecs_service.aws_appautoscaling_policy.this["memory"]: Refreshing state... [id=memory]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.metabase.module.autoscaling["pool1"].aws_autoscaling_group.idc[0] has changed
  ~ resource "aws_autoscaling_group" "idc" {
      ~ desired_capacity                 = 2 -> 5
      + enabled_metrics                  = []
        id                               = "cluster01-pool1-20240408194420311400000001"
        name                             = "cluster01-pool1-20240408194420311400000001"
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.metabase.module.ecs_service.data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "cluster01"
      + task_role_arn        = (known after apply)
    }

  # module.metabase.module.ecs_service.aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:sa-east-1:905418314539:service/cluster01/cluster01"
        name                               = "cluster01"
        tags                               = {
            "Name"       = "metabase"
            "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      ~ task_definition                    = "cluster01:1" -> (known after apply)
        # (14 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "ecs-sample" -> null
          - container_port   = 8888 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:sa-east-1:905418314539:targetgroup/tf-2024040819370025460000000c/2decd681597abeb6" -> null
        }
      + load_balancer {
          + container_name   = "metabase"
          + container_port   = 8888
          + target_group_arn = "arn:aws:elasticloadbalancing:sa-east-1:905418314539:targetgroup/tf-2024040819370025460000000c/2decd681597abeb6"
        }

        # (5 unchanged blocks hidden)
    }

  # module.metabase.module.ecs_service.aws_ecs_task_definition.this[0] must be replaced
+/- resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:sa-east-1:905418314539:task-definition/cluster01:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:sa-east-1:905418314539:task-definition/cluster01" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ cpu                    = 0 -> 256
                  - essential              = true
                  ~ logConfiguration       = {
                      ~ options   = {
                          ~ awslogs-group         = "/aws/ecs/cluster01/ecs-sample" -> "/aws/ecs/cluster01/metabase"
                            # (2 unchanged attributes hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }
                  + memory                 = 512
                  ~ name                   = "ecs-sample" -> "metabase"
                  ~ portMappings           = [
                      ~ {
                          - hostPort      = 8888
                          ~ name          = "ecs-sample" -> "metabase"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (13 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cluster01" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "Name"       = "metabase"
            "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.metabase.module.db_default.module.db_instance.aws_db_instance.this[0] will be updated in-place
  ~ resource "aws_db_instance" "this" {
        id                                    = "db-DCEUY5V77F7E23L6YTTKQWDSVU"
        tags                                  = {
            "Name"       = "metabase"
            "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      ~ vpc_security_group_ids                = [
          - "sg-06b3891f03e18515d",
        ]
        # (55 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.metabase.module.ecs_service.module.container_definition["ecs-sample"].aws_cloudwatch_log_group.this[0] will be destroyed
  # (because module.metabase.module.ecs_service.module.container_definition["ecs-sample"] is not in configuration)
  - resource "aws_cloudwatch_log_group" "this" {
      - arn               = "arn:aws:logs:sa-east-1:905418314539:log-group:/aws/ecs/cluster01/ecs-sample" -> null
      - id                = "/aws/ecs/cluster01/ecs-sample" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/ecs/cluster01/ecs-sample" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Name"       = "metabase"
          - "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        } -> null
      - tags_all          = {
          - "Name"       = "metabase"
          - "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        } -> null
    }

  # module.metabase.module.ecs_service.module.container_definition["metabase"].aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/cluster01/metabase"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all          = {
          + "Name"       = "metabase"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


Pusher: @coolcolden
Action: `pull_request`
